simulation/deltaTheta_60/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 \*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.water
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;

//        MULESCorr       yes;
//        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
	cAlpha 1; 
    }

    alpha.waterFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        cAlpha 1;

    }


    "pcorr.*"
    {
        solver          GAMG; //PCG;
        preconditioner  GaussSeidel; //DIC;
smoother GaussSeidel; 
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG; //PCG;
        preconditioner  GaussSeidel; //DIC;
smoother GaussSeidel; 
        tolerance       1e-07;
        relTol          0.; //0.001;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }


    U
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }   
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     1;
    nNonOrthogonalCorrectors 1;
       smoothingKernel  12; 
	smoothingRelaxFactor  1.0; 

    wallSmoothingKernel  5; 
    uFilter1  .01; 

    lambda   0;
    lambdaS  0;
    cSSlip   0.05;
    nSlip    1.0;

    nUCorr 0;
    beta              beta [ 1 -1 -1 0 0 0 0 ] 0.001;
}
 
relaxationFactors
{
    U               0.3;
    p_rgh               0.3;
}

// ************************************************************************* //
